Ruhanpaco/Aliro-homekey/boards/sdkconfig.defaults.esp32s3
# Generic ESP32-S3 DevKit.
# Target: idf.py set-target esp32s3

CONFIG_IDF_TARGET="esp32s3"

CONFIG_ALIRO_NFC_SPI_SCK=12
CONFIG_ALIRO_NFC_SPI_MISO=13
CONFIG_ALIRO_NFC_SPI_MOSI=11
CONFIG_ALIRO_NFC_SPI_CS=10

CONFIG_ALIRO_LOCK_GPIO=2
CONFIG_ALIRO_READER_TASK_CORE=1
